import { useEffect } from "react";

/**
 * Хук для динамического изменения заголовка документа (вкладки браузера).
 * @param {string} title - Новый заголовок.
 */
export function useDocumentTitle(title) {
  // TODO: Реализуйте хук.
  // 1. Используйте `useEffect` для обновления `document.title`.
  //    - Эффект должен применяться каждый раз, когда изменяется `title`.
  // 2. (Опционально, для лучшей практики) Добавьте функцию очистки,
  //    которая будет возвращать исходный заголовок документа,
  //    когда компонент, использующий хук, размонтируется.
}
